Revit 2027 API
Element.GetValidTypes(Document, ICollection<ElementId>) Method
 Obtains a set of types that are valid for all given elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetValidTypes(
	Document document,
	ICollection<ElementId> elementIds
)
Public Shared Function GetValidTypes (
	document As Document,
	elementIds As ICollection(Of ElementId)
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetValidTypes(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
static member GetValidTypes :
        document : Document *
        elementIds : ICollection<ElementId> -> ICollection<ElementId>
Parameters
document Document
 The document.
elementIds ICollection<ElementId>
 A collection of element IDs.
Return Value
ICollection<ElementId>
 A set of element IDs of types that are valid for these elements or an empty set if any element cannot have a type assigned.
Exceptions
Exception | Condition
ArgumentException |  Thrown when at least one of the elements does not exist in the document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Element Class
GetValidTypes Overload
Autodesk.Revit.DB Namespace